IDENTIFICATION DIVISION.
PROGRAM-ID. PYRA.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-MULT      PIC 9(2)    VALUE 0.
    01 WS-LENGTH    PIC 9(3).
    
PROCEDURE DIVISION.
    A000-FIRST-PARA.
    DISPLAY "Enter the final length of your pyramid: " NO ADVANCING.
    ACCEPT WS-LENGTH.
    DISPLAY "Iterations that will be done: " WS-LENGTH.
    PERFORM B000-SECOND-PARA WS-LENGTH TIMES.
    STOP RUN.
    
    B000-SECOND-PARA.
    ADD 1 TO WS-MULT.
    PERFORM C000-THIRD-PARA WS-MULT TIMES.
    DISPLAY "".
    
    C000-THIRD-PARA.
    DISPLAY "*" NO ADVANCING.
