IDENTIFICATION DIVISION.
PROGRAM-ID. DBPYRA.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-HEIGHT    PIC 9(2).
    01 WS-SPACES    PIC 9(2).
    01 WS-STARS     PIC 9(2) VALUE 1.
    
PROCEDURE DIVISION.
    A000-FIRST-PARA.
    DISPLAY "Enter height of your pyramid: " NO ADVANCING.
    ACCEPT WS-HEIGHT.
    COMPUTE WS-SPACES = WS-HEIGHT - 1.
    PERFORM B000-SECOND-PARA WS-HEIGHT TIMES.
    STOP RUN.
    
    B000-SECOND-PARA.
    PERFORM C000-THIRD-PARA WS-SPACES TIMES.
    SUBTRACT 1 FROM WS-SPACES.
    PERFORM D000-FOURTH-PARA WS-STARS TIMES.
    ADD 2 TO WS-STARS.
    DISPLAY "".
    
    C000-THIRD-PARA.
    DISPLAY " " NO ADVANCING.
    
    D000-FOURTH-PARA.
    DISPLAY "*" NO ADVANCING.
